Repository: jaqcquesndav/Wanzo
Catalog: lib/l10n/app_*.arb
Languages: sw

# supplierDetailsTitle
source: Supplier Details
sw: Maelezo ya Muuzaji

# supplierErrorLoading
source: Error: {message}
sw: Hitilafu: {message}

source: Supplier not found
sw: Muuzaji hajapatikana

# contactLabel
source: Contact
sw: Mawasiliano

# phoneLabel
source: Phone
sw: Simu

# emailLabel
source: Email
sw: Barua Pepe

# addressLabel
source: Address
sw: Anwani

# commercialInformationSectionTitle
source: Commercial Information
sw: Taarifa za Kibiashara

# deliveryTimeInDays
source: {count,plural, =0{Not specified} =1{1 day} other{{count} days}}
sw: {count,plural, =0{Haijabainishwa} =1{siku 1} other{{count} siku}}

# supplierSinceLabel
source: Supplier Since
sw: Muuzaji Tangu

# notesSectionTitle
source: Notes
sw: Maelezo

# placeOrderButtonLabel
source: Place Order
sw: Weka Oda

source: Feature to implement
sw: Kipengele cha kutekeleza

# confirmDeleteSupplierTitle
source: Delete Supplier
sw: Futa Muuzaji

# confirmDeleteSupplierMessage
source: Are you sure you want to delete {supplierName}? This action is irreversible.
sw: Una uhakika unataka kumfuta {supplierName}? Kitendo hiki hakiwezi kutenduliwa.

# commonToday
source: Today
sw: Leo

# commonThisMonth
source: This Month
sw: Mwezi Huu

# commonThisYear
source: This Year
sw: Mwaka Huu

# commonCustom
source: Custom
sw: Maalum

# commonAnonymousClient
source: Anonymous Client
sw: Mteja Asiyejulikana

# commonErrorDataUnavailable
source: Data unavailable
sw: Data haipatikani

# commonNoData
source: No data available
sw: Hakuna data inayopatikana

# dashboardHeaderSalesToday
source: Sales Today
sw: Mauzo ya Leo

# dashboardHeaderClientsServed
source: Clients Served
sw: Wateja Waliohudumiwa

# dashboardHeaderReceivables
source: Receivables
sw: Madeni Yanayodaiwa

# dashboardHeaderTransactions
source: Transactions
sw: Miamala

# dashboardCardViewDetails
source: View Details
sw: Tazama Maelezo

# dashboardSalesChartTitle
source: Sales Overview
sw: Muhtasari wa Mauzo

# dashboardSalesChartNoData
source: No sales data to display for the chart.
sw: Hakuna data ya mauzo ya kuonyesha kwenye chati.

# dashboardRecentSalesTitle
source: Recent Sales
sw: Mauzo ya Hivi Karibuni

# dashboardRecentSalesViewAll
source: View All
sw: Tazama Yote

# dashboardRecentSalesNoData
source: No recent sales.
sw: Hakuna mauzo ya hivi karibuni.

# dashboardOperationsJournalTitle
source: Operations Journal
sw: Jarida la Uendeshaji

# dashboardOperationsJournalViewAll
source: View All
sw: Tazama Yote

# dashboardOperationsJournalNoData
source: No recent operations.
sw: Hakuna shughuli za hivi karibuni.

# dashboardOperationsJournalBalanceLabel
source: Balance
sw: Salio

# dashboardJournalExportSelectDateRangeTitle
source: Select Date Range
sw: Chagua Kipindi cha Tarehe

# dashboardJournalExportExportButton
source: Export to PDF
sw: Hamisha kwa PDF

# dashboardJournalExportPrintButton
source: Print Journal
sw: Chapisha Jarida

# dashboardJournalExportSuccessMessage
source: Journal exported successfully.
sw: Jarida limehamishwa kikamilifu.

# dashboardJournalExportFailureMessage
source: Failed to export journal.
sw: Imeshindwa kuhamisha jarida.

# dashboardJournalExportNoDataForPeriod
source: No data available for the selected period to export.
sw: Hakuna data inayopatikana kwa kipindi kilichochaguliwa ili kuhamisha.

# dashboardJournalExportPrintingMessage
source: Preparing journal for printing...
sw: Inaandaa jarida kwa uchapishaji...

# dashboardQuickActionsTitle
source: Quick Actions
sw: Vitendo vya Haraka

# dashboardQuickActionsNewSale
source: New Sale
sw: Mauzo Mapya

# dashboardQuickActionsNewExpense
source: New Expense
sw: Gharama Mpya

# dashboardQuickActionsNewProduct
source: New Product
sw: Bidhaa Mpya

# dashboardQuickActionsNewService
source: New Service
sw: Huduma Mpya

# dashboardQuickActionsNewClient
source: New Client
sw: Mteja Mpya

# dashboardQuickActionsNewSupplier
source: New Supplier
sw: Muuzaji Mpya

# dashboardQuickActionsCashRegister
source: Cash Register
sw: Rejista ya Pesa

# dashboardQuickActionsSettings
source: Settings
sw: Mipangilio

source: Cancel
sw: Ghairi

# journalPdf_title
source: Operations Journal
sw: Jarida la Uendeshaji

# journalPdf_footer_pageInfo
source: Page {currentPage} of {totalPages}
sw: Ukurasa {currentPage} kati ya {totalPages}

# journalPdf_period
source: Period: {startDate} - {endDate}
sw: Kipindi: {startDate} - {endDate}

# journalPdf_tableHeader_date
source: Date
sw: Tarehe

# journalPdf_tableHeader_time
source: Time
sw: Wakati

# journalPdf_tableHeader_description
source: Description
sw: Maelezo

# journalPdf_tableHeader_debit
source: Debit
sw: Debiti

# journalPdf_tableHeader_credit
source: Credit
sw: Krediti

# journalPdf_tableHeader_balance
source: Balance
sw: Salio

# journalPdf_openingBalance
source: Opening Balance
sw: Salio la Kuanzia

# journalPdf_closingBalance
source: Closing Balance
sw: Salio la Kufunga

# journalPdf_footer_generatedBy
source: Generated by Wanzo
sw: Imetolewa na Wanzo

# adhaHomePageTitle
source: Adha - AI Assistant
sw: Adha - Msaidizi wa AI

# adhaHomePageDescription
source: Adha, your smart business assistant
sw: Adha, msaidizi wako mahiri wa biashara

# adhaHomePageBody
source: Ask me questions about your business and I will help you make the best decisions with personalized analysis and advice.
sw: Niulize maswali kuhusu biashara yako na nitakusaidia kufanya maamuzi bora kwa uchambuzi na ushauri wa kibinafsi.

# startConversationButton
source: Start a conversation
sw: Anzisha mazungumzo

# viewConversationsButton
source: View my conversations
sw: Tazama mazungumzo yangu

# salesAnalysisFeatureTitle
source: Sales Analysis
sw: Uchambuzi wa Mauzo

# salesAnalysisFeatureDescription
source: Get insights into your sales performance
sw: Pata maarifa kuhusu utendaji wako wa mauzo

# inventoryManagementFeatureTitle
source: Inventory Management
sw: Usimamizi wa Mali

# inventoryManagementFeatureDescription
source: Track and optimize your inventory
sw: Fuatilia na uboreshe mali yako

# customerRelationsFeatureTitle
source: Customer Relations
sw: Mahusiano na Wateja

# customerRelationsFeatureDescription
source: Advice for retaining your customers
sw: Ushauri wa kuwahifadhi wateja wako

# financialCalculationsFeatureTitle
source: Financial Calculations
sw: Mahesabu ya Kifedha

# financialCalculationsFeatureDescription
source: Financial projections and analysis
sw: Makadirio na uchambuzi wa kifedha

# loginButton
source: Login
sw: Ingia

# registerButton
source: Register
sw: Jisajili

# passwordLabel
source: Password
sw: Nenosiri

source: Settings
sw: Mipangilio

# settingsTitle
source: Settings
sw: Mipangilio

# settingsDescription
source: Manage your application settings.
sw: Dhibiti mipangilio ya programu yako.

# wanzoFallbackText
source: Wanzo Fallback
sw: Maandishi Mbadala ya Wanzo

source: App Version
sw: Toleo la Programu

source: Loading settings...
sw: Inapakia mipangilio...

source: Company Information
sw: Taarifa za Kampuni

# companyInformationSubtitle
source: Manage your company details
sw: Dhibiti maelezo ya kampuni yako

source: Appearance and Display
sw: Muonekano na Onyesho

# appearanceAndDisplaySubtitle
source: Customize the look and feel
sw: Binafsisha mwonekano na hisia

source: Theme
sw: Mandhari

# themeLight
source: Light
sw: Nuru

# themeDark
source: Dark
sw: Giza

# themeSystem
source: System
sw: Mfumo

source: Language
sw: Lugha

# languageEnglish
source: English
sw: Kiingereza

# languageFrench
source: French
sw: Kifaransa

# languageSwahili
source: Swahili
sw: Kiswahili

source: Date Format
sw: Umbizo la Tarehe

# monthJan
source: January
sw: Januari

# monthFeb
source: February
sw: Februari

# monthMar
source: March
sw: Machi

# monthApr
source: April
sw: Aprili

# monthMay
source: May
sw: Mei

# monthJun
source: June
sw: Juni

# monthJul
source: July
sw: Julai

# monthAug
source: August
sw: Agosti

# monthSep
source: September
sw: Septemba

# monthOct
source: October
sw: Oktoba

# monthNov
source: November
sw: Novemba

# monthDec
source: December
sw: Desemba

source: Change Logo
sw: Badilisha Nembo

source: Company Name
sw: Jina la Kampuni

# companyNameRequired
source: Company name is required
sw: Jina la kampuni linahitajika

source: Email
sw: Barua Pepe

# invalidEmail
source: Invalid email address
sw: Anwani ya barua pepe si sahihi

source: Phone Number
sw: Nambari ya Simu

source: Address
sw: Anwani

# rccmHelperText
source: Trade and Personal Property Credit Register
sw: Rejista ya Biashara na Mikopo ya Mali Binafsi

source: Tax ID
sw: Namba ya Utambulisho wa Mlipakodi (NIM)

# taxIdHelperText
source: National Tax Identification Number
sw: Nambari ya Utambulisho wa Mlipakodi ya Kitaifa

source: Website
sw: Tovuti

source: Invoice Settings
sw: Mipangilio ya Ankara

# invoiceSettingsSubtitle
source: Manage your invoice preferences
sw: Dhibiti mapendeleo yako ya ankara

source: Default Invoice Footer
sw: Kijachini Chaguo-msingi cha Ankara

# defaultInvoiceFooterHint
source: e.g., Thank you for your business!
sw: k.m., Asante kwa biashara yako!

source: Show Total in Words
sw: Onyesha Jumla kwa Maneno

# exchangeRate
source: Exchange Rate (USD to Local)
sw: Kiwango cha Ubadilishaji (USD kwenda Sarafu ya Ndani)

source: Inventory Settings
sw: Mipangilio ya Mali

# inventorySettingsSubtitle
source: Manage your inventory preferences
sw: Dhibiti mapendeleo yako ya mali

source: General Settings
sw: Mipangilio ya Jumla

source: Default Category
sw: Kategoria Chaguo-msingi

# defaultCategoryRequired
source: Default category is required
sw: Kategoria chaguo-msingi inahitajika

source: Low Stock Alert
sw: Tahadhari ya Hisa Chini

# lowStockAlertHint
source: Quantity at which to trigger alert
sw: Kiasi ambacho tahadhari itatolewa

source: Track Inventory
sw: Fuatilia Mali

source: Allow Negative Stock
sw: Ruhusu Hisa Hasi

source: Save Changes
sw: Hifadhi Mabadiliko

source: Settings updated successfully
sw: Mipangilio imesasishwa kikamilifu

source: Error updating settings
sw: Hitilafu kusasisha mipangilio

# changesSaved
source: Changes saved successfully!
sw: Mabadiliko yamehifadhiwa kikamilifu!

source: Error saving changes
sw: Hitilafu kuhifadhi mabadiliko

source: Select Theme
sw: Chagua Mandhari

source: Select Language
sw: Chagua Lugha

source: Select Date Format
sw: Chagua Umbizo la Tarehe

source: Display Settings
sw: Mipangilio ya Onyesho

# displaySettingsDescription
source: Manage display settings.
sw: Dhibiti mipangilio ya onyesho.

source: Company Settings
sw: Mipangilio ya Kampuni

# companySettingsDescription
source: Manage company settings.
sw: Dhibiti mipangilio ya kampuni.

# invoiceSettingsDescription
source: Manage invoice settings.
sw: Dhibiti mipangilio ya ankara.

# inventorySettingsDescription
source: Manage inventory settings.
sw: Dhibiti mipangilio ya mali.

# minValue
source: Min value: {minValue}
sw: Thamani ya chini: {minValue}

# maxValue
source: Max value: {maxValue}
sw: Thamani ya juu: {maxValue}

# valueMustBeNumber
source: Value must be a number
sw: Thamani lazima iwe nambari

source: Value must be positive
sw: Thamani lazima iwe chanya

# fieldRequired
source: This field is required
sw: Sehemu hii inahitajika

# settingsGeneral
source: General
sw: Jumla

# settingsCompany
source: Company
sw: Kampuni

# settingsInvoice
source: Invoice
sw: Ankara

# settingsInventory
source: Inventory
sw: Mali

# settingsAppearance
source: Appearance
sw: Muonekano

source: Search settings...
sw: Tafuta mipangilio...

source: Backup and Reports
sw: Nakala na Ripoti

# backupAndReportsSubtitle
source: Manage data backup and generate reports
sw: Dhibiti nakala ya data na toa ripoti

source: Notifications
sw: Arifa

# notificationsSubtitle
source: Manage app notifications
sw: Dhibiti arifa za programu

source: Reset Settings
sw: Weka Upya Mipangilio

# confirmResetSettings
source: Are you sure you want to reset all settings to their default values? This action cannot be undone.
sw: Una uhakika unataka kuweka upya mipangilio yote kuwa chaguomsingi? Kitendo hiki hakiwezi kutenduliwa.

source: Reset
sw: Weka Upya

source: Tax Identification Number
sw: Nambari ya Utambulisho wa Mlipakodi

source: RCCM Number
sw: Nambari ya RCCM

# idNatNumber
source: National ID Number
sw: Nambari ya Kitambulisho cha Taifa

# idNatHelperText
source: National Identification Number
sw: Nambari ya Utambulisho wa Kitaifa

source: Select Image Source
sw: Chagua Chanzo cha Picha

source: Gallery
sw: Matunzio

source: Camera
sw: Kamera

source: Delete Current Logo
sw: Futa Nembo ya Sasa

source: Logo deleted.
sw: Nembo imefutwa.

source: Logo updated successfully.
sw: Nembo imesasishwa kikamilifu.

# errorSelectingLogo
source: Error selecting logo: {errorDetails}
sw: Hitilafu kuchagua nembo: {errorDetails}

source: Default Product Category
sw: Kategoria Chaguo-msingi ya Bidhaa

source: Stock Alerts
sw: Tahadhari za Hisa

source: Low Stock Alert Days
sw: Siku za Tahadhari ya Hisa Chini

source: Days
sw: Siku

# enterValidNumber
source: Please enter a valid number.
sw: Tafadhali ingiza nambari sahihi.

# lowStockAlertDescription
source: Receive alerts when product stock is low for a specified number of days.
sw: Pokea tahadhari wakati hisa ya bidhaa iko chini kwa idadi maalum ya siku.

source: Product Categories
sw: Kategoria za Bidhaa

source: Manage your product categories.
sw: Dhibiti kategoria zako za bidhaa.

source: Add Category
sw: Ongeza Kategoria

source: Edit Category
sw: Hariri Kategoria

source: Delete Category
sw: Futa Kategoria

source: Category Name
sw: Jina la Kategoria

source: Category name cannot be empty.
sw: Jina la kategoria haliwezi kuwa tupu.

source: Category added
sw: Kategoria imeongezwa

source: Category updated
sw: Kategoria imesasishwa

source: Category deleted
sw: Kategoria imefutwa

# confirmDeleteCategory
source: Are you sure you want to delete this category?
sw: Una uhakika unataka kufuta kategoria hii?

# deleteCategoryMessage
source: This action cannot be undone.
sw: Kitendo hiki hakiwezi kutenduliwa.

# errorAddingCategory
source: Error adding category: {error}
sw: Hitilafu kuongeza kategoria: {error}

# errorUpdatingCategory
source: Error updating category: {error}
sw: Hitilafu kusasisha kategoria: {error}

# errorDeletingCategory
source: Error deleting category: {error}
sw: Hitilafu kufuta kategoria: {error}

# errorFetchingCategories
source: Error fetching categories: {error}
sw: Hitilafu kupata kategoria: {error}

# noCategoriesFound
source: No categories found. Add one to get started!
sw: Hakuna kategoria zilizopatikana. Ongeza moja ili kuanza!
