Repository: jaqcquesndav/Wanzo
Catalog: lib/l10n/app_*.arb
Languages: sw

# commonCancel
source: Cancel
sw: Ghairi

# commonConfirm
source: Confirm
sw: Thibitisha

# commonError
source: Error
sw: Hitilafu

# commonLoading
source: Loading...
sw: Inapakia...

# dashboardScreenTitle
source: Dashboard
sw: Dashibodi

# invoiceSettingsTitle
source: Invoice Settings
sw: Mipangilio ya Ankara

source: Currency Settings
sw: Mipangilio ya Sarafu

source: Active Currency
sw: Sarafu Inayotumika

# exchangeRateSpecific
source: Exchange Rate ({currencyFrom} to {currencyTo})
sw: Kiwango cha ubadilishaji ({currencyFrom} hadi {currencyTo})

# exchangeRateHint
source: e.g., 650 for 1 USD = 650 FCFA
sw: Weka kiwango cha 1 {currencyFrom} hadi {currencyTo}

# errorFieldRequired
source: This field is required.
sw: Sehemu hii inahitajika.

# errorInvalidRate
source: Please enter a valid positive rate.
sw: Tafadhali weka kiwango sahihi chanya.

source: Invoice Formatting
sw: Muundo wa Ankara

# invoiceFormatHint
source: Use {YEAR}, {MONTH}, {SEQ} for dynamic values.
sw: Tumia {YEAR}, {MONTH}, {SEQ} kwa thamani zinazobadilika.

source: Invoice Number Format
sw: Umbizo la Nambari ya Ankara

source: Invoice Prefix
sw: Kiambishi awali cha Ankara

# taxesAndConditions
source: Taxes & Conditions
sw: Kodi na Masharti

source: Show taxes on invoices
sw: Onyesha kodi kwenye ankara

# defaultTaxRatePercentage
source: Default Tax Rate (%)
sw: Kiwango cha Kodi Chaguomsingi (%)

# errorInvalidTaxRate
source: Tax rate must be between 0 and 100.
sw: Kiwango cha kodi lazima kiwe kati ya 0 na 100.

source: Default Payment Terms
sw: Masharti Chaguomsingi ya Malipo

source: Default Invoice Notes
sw: Maelezo Chaguomsingi ya Ankara

# settingsSavedSuccess
source: Settings saved successfully.
sw: Mipangilio imehifadhiwa kikamilifu.

source: An error occurred
sw: Hitilafu imetokea.

# errorUnknown
source: Unknown error
sw: Hitilafu isiyojulikana

# currencySettingsError
source: Could not save currency settings: {errorDetails}
sw: Haikuweza kuhifadhi mipangilio ya sarafu: {errorDetails}

# currencySettingsSavedSuccess
source: Currency settings saved successfully.
sw: Mipangilio ya sarafu imehifadhiwa kikamilifu.

# currencyCDF
source: Congolese Franc
sw: Faranga ya Kongo

# currencyUSD
source: US Dollar
sw: Dola ya Marekani

# currencyFCFA
source: CFA Franc
sw: Faranga ya CFA

# editProductTitle
source: Edit Product
sw: Hariri Bidhaa

# addProductTitle
source: Add Product
sw: Ongeza Bidhaa

# productCategoryFood
source: Food
sw: Chakula

# productCategoryDrink
source: Drink
sw: Kinywaji

# productCategoryOther
source: Other
sw: Nyingine

source: Units
sw: Vipimo

# notes
source: Notes (Optional)
sw: Maelezo (Si lazima)

source: Save Product
sw: Hifadhi Bidhaa

source: Inventory Value
sw: Thamani ya Mali

source: Products
sw: Bidhaa

source: Stock Movements
sw: Mienendo ya Hisa

# noProducts
source: No products yet.
sw: Hakuna bidhaa bado.

# noStockMovements
source: No stock movements yet.
sw: Hakuna mienendo ya hisa bado.

source: Search products...
sw: Tafuta bidhaa...

source: Total Stock
sw: Jumla ya Hisa

# valueInCdf
source: Value (CDF)
sw: Thamani (CDF)

# valueIn
source: Value ({currencyCode})
sw: Thamani ({currencyCode})

source: Last Modified
sw: Imebadilishwa Mwisho

source: Product Details
sw: Maelezo ya Bidhaa

source: Delete Product
sw: Futa Bidhaa

# confirmDeleteProductTitle
source: Confirm Deletion
sw: Thibitisha Kufuta

# confirmDeleteProductMessage
source: Are you sure you want to delete this product? This action cannot be undone.
sw: Una uhakika unataka kufuta bidhaa hii? Kitendo hiki hakiwezi kutenduliwa.

source: Delete
sw: Futa

source: Stock In
sw: Uingizaji Hisa

source: Stock Out
sw: Utoaji Hisa

source: Adjustment
sw: Marekebisho

source: Quantity
sw: Kiasi

# reason
source: Reason (Optional)
sw: Sababu (Si lazima)

source: Add Stock Movement
sw: Ongeza Mwenendo wa Hisa

source: New Stock
sw: Hisa Mpya

source: Value
sw: Thamani

source: Type
sw: Aina

source: Date
sw: Tarehe

source: Product
sw: Bidhaa

source: Select Product
sw: Chagua Bidhaa

source: Select Category
sw: Chagua Kategoria

source: Select Unit
sw: Chagua Kipimo

# imagePickingErrorMessage
source: Error picking image: {errorDetails}
sw: Hitilafu wakati wa kuchagua picha: {errorDetails}

# galleryAction
source: Gallery
sw: Matunzio

# cameraAction
source: Camera
sw: Kamera

# removeImageAction
source: Remove Image
sw: Ondoa Picha

# productImageSectionTitle
source: Product Image
sw: Picha ya Bidhaa

# addImageLabel
source: Add Image
sw: Ongeza Picha

# generalInformationSectionTitle
source: General Information
sw: Taarifa za Jumla

# productNameLabel
source: Product Name
sw: Jina la Bidhaa

# productNameValidationError
source: Please enter the product name.
sw: Tafadhali ingiza jina la bidhaa.

# productDescriptionLabel
source: Description
sw: Maelezo

# productBarcodeLabel
source: Barcode (Optional)
sw: Msimbo Pau (Si lazima)

# featureComingSoonMessage
source: Feature coming soon!
sw: Kipengele kinakuja hivi karibuni!

# productCategoryLabel
source: Category
sw: Kategoria

# productCategoryElectronics
source: Electronics
sw: Elektroniki

# productCategoryClothing
source: Clothing
sw: Nguo

# productCategoryHousehold
source: Household
sw: Vifaa vya Nyumbani

# productCategoryHygiene
source: Hygiene
sw: Usafi

# productCategoryOffice
source: Office Supplies
sw: Vifaa vya Ofisi

# pricingSectionTitle
source: Pricing and Currency
sw: Bei na Sarafu

# inputCurrencyLabel
source: Input Currency
sw: Sarafu ya Kuingiza

# inputCurrencyValidationError
source: Please select an input currency.
sw: Tafadhali chagua sarafu ya kuingiza.

# costPriceLabel
source: Cost Price
sw: Bei ya Gharama

# costPriceValidationError
source: Please enter the cost price.
sw: Tafadhali ingiza bei ya gharama.

# negativePriceValidationError
source: Price cannot be negative.
sw: Bei haiwezi kuwa hasi.

# invalidNumberValidationError
source: Please enter a valid number.
sw: Tafadhali ingiza nambari sahihi.

# sellingPriceLabel
source: Selling Price
sw: Bei ya Kuuza

# sellingPriceValidationError
source: Please enter the selling price.
sw: Tafadhali ingiza bei ya kuuza.

# stockManagementSectionTitle
source: Stock Management
sw: Usimamizi wa Hisa

# stockQuantityLabel
source: Quantity in Stock
sw: Kiasi katika Hisa

# stockQuantityValidationError
source: Please enter the stock quantity.
sw: Tafadhali ingiza kiasi cha hisa.

# negativeQuantityValidationError
source: Quantity cannot be negative.
sw: Kiasi hakiwezi kuwa hasi.

# productUnitLabel
source: Unit
sw: Kipimo

# productUnitPiece
source: Piece(s)
sw: Kipande(Vipande)

# productUnitKg
source: Kilogram(s) (kg)
sw: Kilogramu (kg)

# productUnitG
source: Gram(s) (g)
sw: Gramu (g)

# productUnitL
source: Liter(s) (L)
sw: Lita (L)

# productUnitMl
source: Milliliter(s) (ml)
sw: Mililita (ml)

# productUnitPackage
source: Package(s)
sw: Kifurushi(Vifurushi)

# productUnitBox
source: Box(es)
sw: Sanduku(Masanduku)

# productUnitOther
source: Other Unit
sw: Kipimo Kingine

# lowStockThresholdLabel
source: Low Stock Alert Threshold
sw: Kiwango cha Tahadhari ya Hisa Chini

# lowStockThresholdHelper
source: Receive an alert when stock reaches this level.
sw: Pokea tahadhari hisa inapofikia kiwango hiki.

# lowStockThresholdValidationError
source: Please enter a valid alert threshold.
sw: Tafadhali ingiza kiwango sahihi cha tahadhari.

# negativeThresholdValidationError
source: Threshold cannot be negative.
sw: Kiwango hakiwezi kuwa hasi.

# saveChangesButton
source: Save Changes
sw: Hifadhi Mabadiliko

# addProductButton
source: Add Product
sw: Ongeza Bidhaa

# notesLabelOptional
source: Notes (Optional)
sw: Maelezo (Si lazima)

# addStockDialogTitle
source: Add Stock to {productName}
sw: Ongeza Hisa kwa {productName}

# currentStockLabel
source: Current Stock
sw: Hisa ya Sasa

# quantityToAddLabel
source: Quantity to Add
sw: Kiasi cha Kuongeza

# quantityValidationError
source: Please enter a quantity.
sw: Tafadhali ingiza kiasi.

# positiveQuantityValidationError
source: Quantity must be positive for a purchase.
sw: Kiasi lazima kiwe chanya kwa ununuzi.

# addButtonLabel
source: Add
sw: Ongeza

# stockAdjustmentDefaultNote
source: Stock adjustment
sw: Marekebisho ya hisa

# stockTransactionTypeOther
source: Other
sw: Nyingine

# productInitialFallback
source: P
sw: B

# inventoryScreenTitle
source: Inventory
sw: Mali

# allProductsTabLabel
source: All Products
sw: Bidhaa Zote

# lowStockTabLabel
source: Low Stock
sw: Hisa Chini

# transactionsTabLabel
source: Transactions
sw: Miamala

# noProductsAvailableMessage
source: No products available.
sw: Hakuna bidhaa zinazopatikana.

# noLowStockProductsMessage
source: No products with low stock.
sw: Hakuna bidhaa zenye hisa chini.

# noTransactionsAvailableMessage
source: No transactions available.
sw: Hakuna miamala inayopatikana.

# searchProductDialogTitle
source: Search Product
sw: Tafuta Bidhaa

# searchProductHintText
source: Enter product name or barcode...
sw: Ingiza jina la bidhaa au msimbo pau...

# cancelButtonLabel
source: Cancel
sw: Ghairi

# searchButtonLabel
source: Search
sw: Tafuta

# filterByCategoryDialogTitle
source: Filter by Category
sw: Chuja kwa Kategoria

# noCategoriesAvailableMessage
source: No categories available to filter.
sw: Hakuna kategoria zinazopatikana za kuchuja.

# showAllButtonLabel
source: Show All
sw: Onyesha Zote

# noProductsInInventoryMessage
source: You haven''t added any products to your inventory yet.
sw: Bado hujaongeza bidhaa zozote kwenye mali yako.

# priceLabel
source: Price
sw: Bei

# inputPriceLabel
source: Input
sw: Bei ya Kuingiza

# stockLabel
source: Stock
sw: Hisa

# unknownProductLabel
source: Unknown Product
sw: Bidhaa Isiyojulikana

# quantityLabel
source: Quantity
sw: Kiasi

# dateLabel
source: Date
sw: Tarehe

# valueLabel
source: Label for value
sw: Thamani

# retryButtonLabel
source: Retry
sw: Jaribu Tena

# stockTransactionTypePurchase
source: Purchase
sw: Ununuzi

# stockTransactionTypeSale
source: Sale
sw: Uuzaji

# stockTransactionTypeAdjustment
source: Adjustment
sw: Marekebisho

# salesScreenTitle
source: Sales Management
sw: Usimamizi wa Mauzo

# salesTabAll
source: All
sw: Zote

# salesTabPending
source: Pending
sw: Inasubiri

# salesTabCompleted
source: Completed
sw: Imekamilika

# salesFilterDialogTitle
source: Filter Sales
sw: Chuja Mauzo

# salesFilterDialogCancel
source: Cancel
sw: Ghairi

# salesFilterDialogApply
source: Apply
sw: Tumia

# salesSummaryTotal
source: Total Sales
sw: Jumla ya Mauzo

# salesSummaryCount
source: Number of Sales
sw: Idadi ya Mauzo

# salesStatusPending
source: Pending
sw: Inasubiri

# salesStatusCompleted
source: Completed
sw: Imekamilika

# salesStatusPartiallyPaid
source: Partially Paid
sw: Imelipwa Kiasi

# salesStatusCancelled
source: Cancelled
sw: Imeghairiwa

# salesNoSalesFound
source: No sales found
sw: Hakuna mauzo yaliyopatikana

# salesAddSaleButton
source: Add Sale
sw: Ongeza Mauzo

# salesErrorPrefix
source: Error
sw: Hitilafu

# salesRetryButton
source: Retry
sw: Jaribu Tena

# salesFilterDialogStartDate
source: Start Date
sw: Tarehe ya Kuanza

# salesFilterDialogEndDate
source: End Date
sw: Tarehe ya Mwisho

# salesListItemSaleIdPrefix
source: Sale #
sw: Mauzo #

# salesListItemArticles
source: {count,plural, =1{1 article} other{{count} articles}}
sw: {count,plural, =1{bidhaa 1} other{{count} bidhaa}}

# salesListItemTotal
source: Total:
sw: Jumla:

# salesListItemRemainingToPay
source: Remaining to pay:
sw: Kiasi Kilichobaki Kulipa:

# subscriptionScreenTitle
source: Subscription Management
sw: Usimamizi wa Usajili

# subscriptionUnsupportedFileType
source: Unsupported file type. Please choose a JPG or PNG file.
sw: Aina ya faili haitumiki. Tafadhali chagua faili ya JPG au PNG.

# subscriptionFileTooLarge
source: File too large. Maximum size is 5MB.
sw: Faili ni kubwa mno. Ukubwa wa juu ni 5MB.

# subscriptionNoImageSelected
source: No image selected.
sw: Hakuna picha iliyochaguliwa.

# subscriptionUpdateSuccessMessage
source: Subscription updated successfully.
sw: Usajili umesasishwa kikamilifu.

# subscriptionUpdateFailureMessage
source: Failed to update subscription: {error}
sw: Imeshindwa kusasisha usajili: {error}

# subscriptionTokenTopUpSuccessMessage
source: Tokens topped up successfully.
sw: Tokeni zimeongezwa kikamilifu.

# subscriptionTokenTopUpFailureMessage
source: Failed to top up tokens: {error}
sw: Imeshindwa kuongeza tokeni: {error}

# subscriptionPaymentProofUploadSuccessMessage
source: Payment proof uploaded successfully.
sw: Uthibitisho wa malipo umepakiwa kikamilifu.

# subscriptionPaymentProofUploadFailureMessage
source: Failed to upload payment proof: {error}
sw: Imeshindwa kupakia uthibitisho wa malipo: {error}

# subscriptionRetryButton
source: Retry
sw: Jaribu Tena

# subscriptionUnhandledState
source: Unhandled state or initialization...
sw: Hali isiyoshughulikiwa au uanzishaji...

# subscriptionSectionOurOffers
source: Our Subscription Offers
sw: Matoleo Yetu ya Usajili

# subscriptionSectionCurrentSubscription
source: Your Current Subscription
sw: Usajili Wako wa Sasa

# subscriptionSectionTokenUsage
source: Adha Token Usage
sw: Matumizi ya Tokeni za Adha

# subscriptionSectionInvoiceHistory
source: Invoice History
sw: Historia ya Ankara

# subscriptionSectionPaymentMethods
source: Payment Methods
sw: Njia za Malipo

# subscriptionChangeSubscriptionButton
source: Change Subscription
sw: Badilisha Usajili

# subscriptionTierFree
source: Free
sw: Bure

# subscriptionTierUsers
source: Users: {count}
sw: Watumiaji: {count}

# subscriptionTierAdhaTokens
source: Adha Tokens: {count}
sw: Tokeni za Adha: {count}

# subscriptionTierFeatures
source: Features:
sw: Vipengele:

# subscriptionTierCurrentPlanChip
source: Current Plan
sw: Mpango wa Sasa

# subscriptionTierChoosePlanButton
source: Choose this plan
sw: Chagua mpango huu

# subscriptionCurrentPlanTitle
source: Current Plan: {tierName}
sw: Mpango wa Sasa: {tierName}

# subscriptionCurrentPlanPrice
source: Price: {price}
sw: Bei: {price}

# subscriptionAvailableAdhaTokens
source: Available Adha Tokens: {count}
sw: Tokeni za Adha Zinazopatikana: {count}

# subscriptionTopUpTokensButton
source: Top-up Tokens
sw: Ongeza Tokeni

# subscriptionNoInvoices
source: No invoices available at the moment.
sw: Hakuna ankara zinazopatikana kwa sasa.

# subscriptionInvoiceListTitle
source: Invoice {id} - {date}
sw: Ankara {id} - {date}

# subscriptionInvoiceListSubtitle
source: Amount: {amount} - Status: {status}
sw: Kiasi: {amount} - Hali: {status}

# subscriptionDownloadInvoiceTooltip
source: Download invoice
sw: Pakua ankara

# subscriptionSimulateDownloadInvoice
source: Simulation: Downloading {id} from {url}
sw: Uigaji: Inapakua {id} kutoka {url}

# subscriptionSimulateViewInvoiceDetails
source: Simulation: View invoice details {id}
sw: Uigaji: Tazama maelezo ya ankara {id}

# subscriptionPaymentMethodsNextInvoice
source: Payment methods for the next invoice:
sw: Njia za malipo kwa ankara inayofuata:

# subscriptionPaymentMethodsRegistered
source: Registered methods:
sw: Njia zilizosajiliwa:

# subscriptionPaymentMethodsOtherOptions
source: Other payment options:
sw: Chaguo zingine za malipo:

# subscriptionPaymentMethodNewCard
source: New Credit Card
sw: Kadi Mpya ya Mkopo

# subscriptionPaymentMethodNewMobileMoney
source: New Mobile Money
sw: Pesa Mpya ya Simu

# subscriptionPaymentMethodManual
source: Manual Payment (Transfer/Deposit)
sw: Malipo ya Mwongozo (Uhamisho/Amana)

# subscriptionManualPaymentInstructions
source: Please make the transfer/deposit to the provided details and upload a proof of payment.
sw: Tafadhali fanya uhamisho/amana kwa maelezo yaliyotolewa na upakie uthibitisho wa malipo.

# subscriptionProofUploadedLabel
source: Proof Uploaded: {fileName}
sw: Uthibitisho Umepakiwa: {fileName}

# subscriptionUploadProofButton
source: Upload Proof
sw: Pakia Uthibitisho

# subscriptionReplaceProofButton
source: Replace Proof
sw: Badilisha Uthibitisho

# subscriptionConfirmPaymentMethodButton
source: Confirm Payment Method
sw: Thibitisha Njia ya Malipo

# subscriptionSimulatePaymentMethodSelected
source: Selected payment method: {method} (Simulation)
sw: Njia ya malipo iliyochaguliwa: {method} (Uigaji)

# subscriptionChangeDialogTitle
source: Change Subscription
sw: Badilisha Usajili

# subscriptionChangeDialogTierSubtitle
source: {price} - Tokens: {tokens}
sw: {price} - Tokeni: {tokens}

# subscriptionTopUpDialogTitle
source: Top-up Adha Tokens
sw: Ongeza Tokeni za Adha

# subscriptionNoActivePlan
source: You do not have an active subscription plan.
sw: Huna mpango wa usajili unaotumika.

# contactsScreenTitle
source: Contacts
sw: Anwani

# contactsScreenClientsTab
source: Clients
sw: Wateja

# contactsScreenSuppliersTab
source: Suppliers
sw: Wauzaji

# contactsScreenAddClientTooltip
source: Add a client
sw: Ongeza mteja

# contactsScreenAddSupplierTooltip
source: Add a supplier
sw: Ongeza muuzaji

# searchCustomerHint
source: Search for a customer...
sw: Tafuta mteja...

# customerError
source: Error: {message}
sw: Hitilafu: {message}

# noCustomersToShow
source: No customers to display
sw: Hakuna wateja wa kuonyesha

# customersTitle
source: Customers
sw: Wateja

# filterCustomersTooltip
source: Filter customers
sw: Chuja wateja

# addCustomerTooltip
source: Add a new customer
sw: Ongeza mteja mpya

source: No results for {searchTerm}
sw: Hakuna matokeo ya {searchTerm}

source: No customers available
sw: Hakuna wateja wanaopatikana

source: Top customers by purchases
sw: Wateja wakuu kwa ununuzi

source: Recently added customers
sw: Wateja walioongezwa hivi karibuni

source: Results for {searchTerm}
sw: Matokeo ya {searchTerm}

source: Last purchase: {date}
sw: Ununuzi wa mwisho: {date}

source: No recent purchase
sw: Hakuna ununuzi wa hivi karibuni

source: Total purchases: {amount}
sw: Jumla ya ununuzi: {amount}

source: View details
sw: Tazama maelezo

source: Edit
sw: Hariri

source: All customers
sw: Wateja wote

source: Top customers
sw: Wateja wakuu

source: Recent customers
sw: Wateja wa hivi karibuni

source: By category
sw: Kwa Kategoria

source: Filter by category
sw: Chuja kwa kategoria

# deleteCustomerTitle
source: Delete customer
sw: Futa mteja

# deleteCustomerConfirmation
source: Are you sure you want to delete {customerName}? This action is irreversible.
sw: Una uhakika unataka kumfuta {customerName}? Kitendo hiki hakiwezi kutenduliwa.

# customerCategoryRegular
source: Regular
sw: Kawaida

# customerCategoryNew
source: New
sw: Mpya

# customerCategoryOccasional
source: Occasional
sw: Wa Mara kwa Mara

# customerCategoryBusiness
source: Business
sw: Biashara

# customerCategoryUnknown
source: Unknown
sw: Haijulikani

# editCustomerTitle
source: Edit Customer
sw: Hariri Mteja

# addCustomerTitle
source: Add Customer
sw: Ongeza Mteja

source: Customer Information
sw: Taarifa za Mteja

# customerNameLabel
source: Customer Name
sw: Jina la Mteja

# customerNameValidationError
source: Please enter the customer's name.
sw: Tafadhali ingiza jina la mteja.

# customerPhoneLabel
source: Customer Phone
sw: Simu ya Mteja

# customerPhoneValidationError
source: Please enter the customer's phone number.
sw: Tafadhali ingiza nambari ya simu ya mteja.

# customerEmailLabel
source: Customer Email (Optional)
sw: Barua Pepe ya Mteja (Si lazima)

# customerEmailLabelOptional
source: Customer Email
sw: Barua Pepe ya Mteja

# customerEmailValidationError
source: Please enter a valid email address.
sw: Tafadhali ingiza anwani sahihi ya barua pepe.

# customerAddressLabel
source: Customer Address (Optional)
sw: Anwani ya Mteja (Si lazima)

# customerAddressLabelOptional
source: Customer Address
sw: Anwani ya Mteja

# customerCategoryLabel
source: Customer Category
sw: Kategoria ya Mteja

# customerNotesLabel
source: Notes (Optional)
sw: Maelezo (Si lazima)

# updateButtonLabel
source: Update
sw: Sasisha

# customerDetailsTitle
source: Customer Details
sw: Maelezo ya Mteja

# editCustomerTooltip
source: Edit customer
sw: Hariri mteja

source: Customer not found
sw: Mteja hajapatikana

# contactInformationSectionTitle
source: Contact Information
sw: Taarifa za Mawasiliano

# purchaseStatisticsSectionTitle
source: Purchase Statistics
sw: Takwimu za Ununuzi

# totalPurchasesLabel
source: Total Purchases
sw: Jumla ya Ununuzi

# lastPurchaseLabel
source: Last Purchase
sw: Ununuzi wa Mwisho

source: No purchase recorded
sw: Hakuna ununuzi uliorekodiwa

# customerSinceLabel
source: Customer Since
sw: Mteja Tangu

# addSaleButtonLabel
source: Add Sale
sw: Ongeza Mauzo

# callButtonLabel
source: Call
sw: Piga Simu

# deleteButtonLabel
source: Delete
sw: Futa

# callingNumber
source: Calling {phoneNumber}...
sw: Inapiga {phoneNumber}...

# emailingTo
source: Emailing to {email}...
sw: Inatuma barua pepe kwa {email}...

# openingMapFor
source: Opening map for {address}...
sw: Inafungua ramani ya {address}...

# searchSupplierHint
source: Search for a supplier...
sw: Tafuta muuzaji...

# clearSearchTooltip
source: Clear search
sw: Futa utafutaji

# supplierError
source: Error: {message}
sw: Hitilafu: {message}

# noSuppliersToShow
source: No suppliers to display
sw: Hakuna wauzaji wa kuonyesha

# suppliersTitle
source: Suppliers
sw: Wauzaji

# filterSuppliersTooltip
source: Filter suppliers
sw: Chuja wauzaji

# addSupplierTooltip
source: Add a new supplier
sw: Ongeza muuzaji mpya

source: No suppliers available
sw: Hakuna wauzaji wanaopatikana

source: Top suppliers by purchases
sw: Wauzaji wakuu kwa ununuzi

source: Recently added suppliers
sw: Wauzaji walioongezwa hivi karibuni

# contactPerson
source: Contact: {name}
sw: Mawasiliano: {name}

# moreOptionsTooltip
source: More options
sw: Chaguo zaidi

source: All suppliers
sw: Wauzaji wote

source: Top suppliers
sw: Wauzaji wakuu

source: Recent suppliers
sw: Wauzaji wa hivi karibuni

# deleteSupplierTitle
source: Delete supplier
sw: Futa muuzaji

# deleteSupplierConfirmation
source: Are you sure you want to delete {supplierName}? This action is irreversible.
sw: Una uhakika unataka kumfuta {supplierName}? Kitendo hiki hakiwezi kutenduliwa.

# supplierCategoryStrategic
source: Strategic
sw: Kimkakati

# supplierCategoryRegular
source: Regular
sw: Kawaida

# supplierCategoryNew
source: New
sw: Mpya

# supplierCategoryOccasional
source: Occasional
sw: Wa Mara kwa Mara

# supplierCategoryInternational
source: International
sw: Kimataifa

# supplierCategoryUnknown
source: Unknown
sw: Haijulikani

# supplierCategoryLocal
source: Local
sw: Wa Ndani

# supplierCategoryOnline
source: Online
sw: Mtandaoni

# addSupplierTitle
source: Add Supplier
sw: Ongeza Muuzaji

# editSupplierTitle
source: Edit Supplier
sw: Hariri Muuzaji

source: Supplier Information
sw: Taarifa za Muuzaji

# supplierNameLabel
source: Supplier Name *
sw: Jina la Muuzaji *

# supplierNameValidationError
source: Name is required
sw: Jina linahitajika

# supplierPhoneLabel
source: Phone Number *
sw: Nambari ya Simu *

# supplierPhoneValidationError
source: Phone number is required
sw: Nambari ya simu inahitajika

# supplierEmailLabel
source: Email
sw: Barua Pepe

# supplierEmailValidationError
source: Please enter a valid email
sw: Tafadhali ingiza barua pepe sahihi

# supplierContactPersonLabel
source: Contact Person
sw: Mtu wa Kuwasiliana Naye

# supplierAddressLabel
source: Address
sw: Anwani

source: Commercial Information
sw: Taarifa za Kibiashara

# deliveryTimeLabel
source: Delivery Time
sw: Muda wa Uwasilishaji

# paymentTermsLabel
source: Payment Terms
sw: Masharti ya Malipo

# paymentTermsHint
source: Ex: Net 30, 50% upfront, etc.
sw: Mfano: Siku 30, 50% mwanzo, n.k.

# supplierCategoryLabel
source: Supplier Category
sw: Kategoria ya Muuzaji

# supplierNotesLabel
source: Notes
sw: Maelezo

# updateSupplierButton
source: Update
sw: Sasisha

# addSupplierButton
source: Add
sw: Ongeza
